t = input("Введите время начала разговора (в формате день:часы:минуты:секунды): ").split(sep=":")
dt = input("Продолжительность разговора (в формате день:часы:минуты:секунды): ").split(sep=":")
s = float(input("Стоимость разговора (в минуту): "))/60
c = 1.0
total = 0.0
for i in range(4):
    t[i] = int(t[i])
    dt[i] = int(dt[i])

dt[1] = dt[1] + dt[0] * 24; dt[0] = 0
dt[2] = dt[2] + dt[1] * 60; dt[1] = 0
dt[3] = dt[3] + dt[2] * 60; dt[2] = 0

for i in range(dt[3]):

    if t[0] >= 6:
        c = 0.9
        if t[1] >= 22 or t[1] < 8:
            c = 0.72
    else:
        if t[1] >= 22 or t[1] < 8:
            c = 0.8
        else:
            c = 1

    total = total + s * c
    t[3] = t[3] + 1

    print("Секунда " + str(i) + " Кэф " + str(c) + " Накапало " + str(total))

    if t[3] >= 60:
        t[2] = t[2] + 1
        t[3] = t[3] - 60
    if t[2] >= 60:
        t[1] = t[1] + 1
        t[2] = t[2] - 60
    if t[1] >= 24:
        t[0] = t[0] + 1
        t[1] = t[1] - 24
    if t[0] > 7:
        t[0] = 1
print("Итоги:"
      +"\nДень недели конца разговора: " + str(t[0])
      + "\nЧас конца разговора: " + str(t[1])
      + "\nМинута конца разговора: " + str(t[2])
      + "\nСекунда конца разговора: " + str(t[3])
      + "\nСекунд всего прошло: " + str(dt[3])
      + "\nПолная стоимость разговора: " + str(total))